
Функция ПолучитьКурсы(Дата)
	ЗаписьРегистраСоздана = Ложь;

	Если Дата <> '00010101000000' Тогда
		Если Дата > ТекущаяДата() Тогда
			Возврат ("Значение поля 'Дата' больше чем текущая дата");
		КонецЕсли;
		ДатаЛФ = Формат(Дата,"ДЛФ=Д");
		XMLДокумент = "https://nationalbank.kz/rss/get_rates.cfm?fdate=" + ДатаЛФ;
		
		Попытка
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.ОткрытьФайл(XMLДокумент);
			ИмяТекущегоУзла = "";
			ТаблицаЗначений = Новый ТаблицаЗначений;
			ТаблицаЗначений.Колонки.Добавить("Наименование");
			ТаблицаЗначений.Колонки.Добавить("КодВалюты");
			ТаблицаЗначений.Колонки.Добавить("Количество");
			ТаблицаЗначений.Колонки.Добавить("Изменение"); 
			ТаблицаЗначений.Колонки.Добавить("Индекс");
			ТаблицаЗначений.Колонки.Добавить("КурсКТенге");
			Пока ЧтениеXML.Прочитать() Цикл
				
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					ИмяТекущегоУзла =  ЧтениеXML.Имя;
					Если ИмяТекущегоУзла = "item" Тогда  
						ЗаписьТЗ = ТаблицаЗначений.Добавить();
						ЗаписьРегистраСоздана = Истина;
					КонецЕсли;   
					
				ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
					Если ЗаписьРегистраСоздана Тогда
						Если ИмяТекущегоУзла = "fullname" Тогда
							ЗаписьТЗ.Наименование = ЧтениеXML.Значение;
						КонецЕсли;
						Если ИмяТекущегоУзла = "title" Тогда
							 ЗаписьТЗ.КодВалюты = ЧтениеXML.Значение;
						КонецЕсли;
						Если ИмяТекущегоУзла = "quant" Тогда
							  ЗаписьТЗ.Количество = ЧтениеXML.Значение;
						КонецЕсли;
						Если ИмяТекущегоУзла = "change" Тогда
							  ЗаписьТЗ.Изменение = ЧтениеXML.Значение;
						КонецЕсли;
						Если ИмяТекущегоУзла = "description" Тогда
							  ЗаписьТЗ.КурсКТенге = ЧтениеXML.Значение;
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						Если ЧтениеXML.Имя = "item" Тогда
							ЗаписьРегистраСоздана = Ложь;
						КонецЕсли;

				КонецЕсли; 
					  
			КонецЦикла;
			ЧтениеXML.Закрыть();
		
			Возврат ТаблицаЗначений;
		Исключение
			Возврат (ОписаниеОшибки());
		КонецПопытки;
	Иначе
	   Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучениеАктуальныхКурсовВалют() Экспорт
	ТекДата = ТекущаяДата();
	Ответ = ПолучитьКурсы(ТекДата);
	Попытка
		Валюта = Справочники.Валюты.НайтиПоНаименованию("KZT");
		Если Валюта = Справочники.Валюты.ПустаяСсылка() Тогда
				Валюта = Справочники.Валюты.СоздатьЭлемент();
				Валюта.Наименование = "KZT";
				Валюта.Название 	=  "КАЗАХСТАНСКИЙ ТЕНГЕ";
				Валюта.Записать();
		КонецЕсли;

		Для Каждого СтрокаТЗ из Ответ Цикл
			
			Валюта = Справочники.Валюты.НайтиПоНаименованию(СтрокаТЗ.КодВалюты);
			Если Валюта = Справочники.Валюты.ПустаяСсылка() Тогда
				Валюта = Справочники.Валюты.СоздатьЭлемент();
				Валюта.Наименование = СтрокаТЗ.КодВалюты;
				Валюта.Название 	=  СтрокаТЗ.Наименование;
				Валюта.Записать();
			КонецЕсли;
			
			КурсВалют = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			КурсВалют.Период = ТекДата;  	
			КурсВалют.ПолноеНазвание 	= СтрокаТЗ.Наименование;
			КурсВалют.КодВалюты 		= Валюта.Наименование;
			КурсВалют.Курс 				= СтрокаТЗ.КурсКТенге;
			КурсВалют.Записать();	
			//СтрокаТЧ.Изменение  	= СтрокаТЗ.Изменение;
		КонецЦикла;
	Исключение
		Запись = РегистрыСведений.ЛогОшибок.СоздатьМенеджерЗаписи();
		Запись.Метод = "Получение курсов валют";
		Запись.Ошибка = "Не удалось записать курс: " + ОписаниеОшибки();
		Запись.Дата = ТекДата;
		Запись.Записать();

		Сообщить("Не удалось загрузить");
	КонецПопытки;
	
КонецФункции //ЗаписатьВРегистрКурсыВалют

