
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Денежный Приход
	Движения.Денежный.Записывать = Истина; 
	
	
	Для Каждого ТекСтрокаОперации Из Операции Цикл
		Движение = Движения.Денежный.Добавить();
		
		Движение.Период = ТекСтрокаОперации.Дата;
		Движение.Валюта = Валюта;
		Движение.Кошелек = Кошелек;
		Если ТекСтрокаОперации.Сумма >= 0 Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сумма = ТекСтрокаОперации.Сумма;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = ТекСтрокаОперации.Сумма * (-1);	
		КонецЕсли;
		Движение.Пояснение = ТекСтрокаОперации.Детализация;
	КонецЦикла;
КонецПроцедуры
