

Функция ПолучитьОсновнойКошелек()
	
	    Настройки = Отчет.КомпоновщикНастроек.Настройки;
    	Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
			|	ОсновнойКошелекСрезПоследних.Кошелек КАК Кошелек
			|ИЗ
			|	РегистрСведений.ОсновнойКошелек.СрезПоследних(, Основной) КАК ОсновнойКошелекСрезПоследних";

		ВыборкаКошелек = Запрос.Выполнить().Выбрать();

		Если ВыборкаКошелек.Следующий() Тогда
			
			Возврат ВыборкаКошелек.Кошелек;
			  
		Иначе
			Возврат Неопределено;
		КонецЕсли;

	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Кошелек = ПолучитьОсновнойКошелек();
	Если Кошелек <> Неопределено Тогда
		ПараметрыСКД = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
		НайденныйПараметр = ПараметрыСКД.найти("Кошелек");	
		НайденныйПараметр.Значение = Кошелек;
		НайденныйПараметр.Использование = Истина;	  			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
