
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Денежный Расход
	Движение_Денежный(Движения.Денежный);
	
	//регистр долги
	Движение_Долги(Движения.ЗаписьДолгов);
КонецПроцедуры


Функция Движение_Денежный(РегистрДенежный)
	Если Актуальный Тогда
		
		РегистрДенежный.Записывать = Истина;
		Движение = РегистрДенежный.Добавить();
		Если КтоДолжен <> Справочники.Физлица.Вы Тогда
			
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;

		Движение.Период = Дата;
		Движение.Валюта = Валюта;
		Движение.Кошелек = Счет;
		Движение.ТипСчета= Счет.ТипСчета;
		Движение.Сумма = Сумма;
		Движение.Пояснение = "Долг, Причина: "+ Причина;
		РегистрДенежный.Записать(); 
	Иначе
		РегистрДенежный.Отбор.Регистратор.Установить(Ссылка);
		РегистрДенежный.Прочитать();
		Если РегистрДенежный.Количество() > 0 Тогда
			РегистрДенежный.Очистить();
			РегистрДенежный.Записать();
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция Движение_Долги(ЗаписьДолгов)
   	ЗаписьДолгов.Записывать = Истина;
	НоваяЗапись = ЗаписьДолгов.Добавить();
	
	НоваяЗапись.Период = Дата;
	НоваяЗапись.Должник = КтоДолжен;
	НоваяЗапись.Актуальность = Актуальный;
	НоваяЗапись.Сумма = Сумма;
	НоваяЗапись.ДатаВозврата = ДатаВозврата;
	НоваяЗапись.КомуДолжны = КомуДолжны;
	ЗаписьДолгов.Записать(Истина);
КонецФункции
