

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НоваяОперация(Команда)
	ОткрытьФорму("Документ.Операция.ФормаОбъекта",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаСервере
Процедура НоваяОперацияНаСервере()
		
КонецПроцедуры

&НаКлиенте
Процедура БалансНажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.ФормаВсеОтчеты");
КонецПроцедуры

&НаКлиенте
Процедура Декорация4Нажатие(Элемент)
	ОткрытьФорму("Документ.Долги.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация9Нажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаКаспи");
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти