
&НаКлиенте
Процедура ТабличнаяЧастьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элемент.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	
	
		// Открываем Данные
		
		Если ТекДанные.Имя = "Операции" Тогда
			ОткрытьФорму("Документ.Операция.ФормаСписка");		
			ЭтаФорма.Закрыть();
		ИначеЕсли ТекДанные.Имя = "Операции kaspi.kz" Тогда
			ОткрытьФорму("Документ.ОперацииKaspi.ФормаСписка");		
			ЭтаФорма.Закрыть();
		Иначе
			ИмяОбъекта = "%1.Форма";
			ИмяОтчета = СтрЗаменить(ИмяОбъекта,"%1",ТекДанные.ПолноеИмя);
			ОткрытьФорму(ИмяОтчета);
			
			ЭтаФорма.Закрыть();	
		КонецЕсли;
	
КонецПроцедуры                                   	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Инд = 1;
	НоваяСтрока = ТабличнаяЧасть.Добавить();
	НоваяСтрока.НомерСтроки = Инд;
	НоваяСтрока.Имя = "Операции";
	Инд = 2;
	НоваяСтрока = ТабличнаяЧасть.Добавить();
	НоваяСтрока.НомерСтроки = Инд;
	НоваяСтрока.Имя = "Операции kaspi.kz";	
	Для Кол = 1 По Метаданные.Отчеты.Количество() Цикл 
		Инд = Инд + 1;
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		НоваяСтрока.НомерСтроки = Инд;
		НоваяСтрока.Имя = Метаданные.Отчеты.Получить(Кол-1);
		НоваяСтрока.ПолноеИмя = Метаданные.Отчеты.Получить(Кол-1).ПолноеИмя();
	КонецЦикла;
	
КонецПроцедуры
                                                           