
&НаКлиенте
Процедура ПродолжитьДальше(Команда)
	ЗаполнитьКонстанты();
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаСервере
Функция ЗаполнитьКонстанты()
	Константы.БылВходРаньше.Установить(Истина);
КонецФункции

&НаСервере
Функция УстановитьОсновнуюВалюту()
	РС = РегистрыСведений.ОсновнаяВалюта.СоздатьНаборЗаписей();
	НоваяЗапись = РС.Добавить();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Валюта = Объект.Валюта;
	НоваяЗапись.Основная = Истина; 
	РС.Записать(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновнаяВалюта.Валюта КАК Валюта
		|ИЗ
		|	РегистрСведений.ОсновнаяВалюта КАК ОсновнаяВалюта
		|ГДЕ
		|	ОсновнаяВалюта.Основная
		|	И НЕ ОсновнаяВалюта.Валюта = &Валюта";
	Запрос.УстановитьПараметр("Валюта",Объект.Валюта);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Валюты = РегистрыСведений.ОсновнаяВалюта.СоздатьНаборЗаписей(); 
	Пока Выборка.Следующий() Цикл
		
		Валюты.Отбор.Валюта.Установить(Выборка.Валюта);
		Валюты.Прочитать();
		Валюты.Очистить();
		Валюты.Записать();
	КонецЦикла;

КонецФункции


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ Объект.Валюта.Пустая() И НЕ Объект.Кошелек.Пустая() Тогда
		ЗаполнитьКонстанты();
	Иначе
		ЗавершитьРаботуСистемы();	
	КонецЕсли;
КонецПроцедуры                       

&НаКлиенте
Процедура ОбработчикОжиданияПараметровСеанса() Экспорт
	Если Объект.Валюта.Пустая() ИЛИ Объект.Кошелек.Пустая() Тогда
		Элементы.Продолжить.Доступность = Ложь;
		Элементы.ОсобыйТекст1.Видимость = Истина;
	Иначе
	
			Элементы.Продолжить.Доступность = Истина;
			Элементы.ОсобыйТекст1.Видимость = Ложь;
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбработчикОжиданияПараметровСеанса",1,Ложь);
КонецПроцедуры


&НаКлиенте
Процедура СоздатьКошелек(Команда)
	
	ОткрытьФорму("Справочник.Кошельки.Форма.ФормаЭлемента",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВеcьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
   	Если ЗначениеЗаполнено(Объект.Валюта) Тогда
		Элементы.Кошелек.Доступность = Истина;
		УстановитьОсновнуюВалюту();
	Иначе
		Элементы.Кошелек.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры




