
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Денежный.Период КАК Период
		|ИЗ
		|	РегистрНакопления.Денежный КАК Денежный
		|ГДЕ
		|	Денежный.Кошелек = &Кошелек
		|	И Денежный.ТипСчета = &ТипСчета";
	
	Запрос.УстановитьПараметр("Кошелек", Кошелек);
	Запрос.УстановитьПараметр("ТипСчета", Кошелек.ТипСчета);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Движения.Денежный.Записывать = Ложь;
	Иначе
		Движения.Денежный.Записывать = Истина;	
	КонецЕсли;
	
	НоваяЗапись = Движения.Денежный.Добавить();
	НоваяЗапись.Период = Кошелек.ДатаНачальногоОстатка;
	НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновнаяВалютаСрезПоследних.Валюта КАК Валюта
		|ИЗ
		|	РегистрСведений.ОсновнаяВалюта.СрезПоследних(, Основная) КАК ОсновнаяВалютаСрезПоследних";
	ВыборкаВалюта = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаВалюта.Следующий() Тогда
		Валюта = ВыборкаВалюта.Валюта; 		
	КонецЕсли;
			
	НоваяЗапись.Валюта = Валюта;
	НоваяЗапись.Пояснение = "Введение начального остатка.";
	НоваяЗапись.Кошелек = Кошелек;
	НоваяЗапись.Сумма = Кошелек.НачальныйОстаток;
	НоваяЗапись.ТипСчета = Кошелек.ТипСчета;
	
КонецПроцедуры
